---
kind: other
id: Methods.T:Autodesk.Revit.DB.KeyBasedTreeEntries
source: html/e7219dca-e0a2-a46d-9b80-597b769fcc65.htm
---
# KeyBasedTreeEntries Methods

Finds the KeyBasedTreeEntry associated with the given key value.